tutorials/chtMultiRegion4PCMFoam/EPCMBlock/constant/ToVsTime
(
    (0.00 285.01)
    (60.00 284.98)
    (120.00 284.94)
    (180.00 284.91)
    (240.00 284.88)
    (300.00 284.85)
    (360.00 284.82)
    (420.00 284.79)
    (480.00 284.76)
    (540.00 284.73)
    (600.00 284.69)
    (660.00 284.66)
    (720.00 284.63)
    (780.00 284.61)
    (840.00 284.58)
    (900.00 284.55)
    (960.00 284.52)
    (1020.00 284.49)
    (1080.00 284.46)
    (1140.00 284.43)
    (1200.00 284.41)
    (1260.00 284.38)
    (1320.00 284.35)
    (1380.00 284.32)
    (1440.00 284.30)
    (1500.00 284.27)
    (1560.00 284.24)
    (1620.00 284.22)
    (1680.00 284.19)
    (1740.00 284.17)
    (1800.00 284.14)
    (1860.00 284.12)
    (1920.00 284.09)
    (1980.00 284.07)
    (2040.00 284.04)
    (2100.00 284.02)
    (2160.00 284.00)
    (2220.00 283.97)
    (2280.00 283.95)
    (2340.00 283.93)
    (2400.00 283.90)
    (2460.00 283.88)
    (2520.00 283.86)
    (2580.00 283.84)
    (2640.00 283.82)
    (2700.00 283.80)
    (2760.00 283.78)
    (2820.00 283.75)
    (2880.00 283.73)
    (2940.00 283.71)
    (3000.00 283.69)
    (3060.00 283.67)
    (3120.00 283.66)
    (3180.00 283.64)
    (3240.00 283.62)
    (3300.00 283.60)
    (3360.00 283.58)
    (3420.00 283.56)
    (3480.00 283.55)
    (3540.00 283.53)
    (3600.00 283.51)
    (3660.00 283.49)
    (3720.00 283.48)
    (3780.00 283.46)
    (3840.00 283.45)
    (3900.00 283.43)
    (3960.00 283.41)
    (4020.00 283.40)
    (4080.00 283.38)
    (4140.00 283.37)
    (4200.00 283.36)
    (4260.00 283.34)
    (4320.00 283.33)
    (4380.00 283.31)
    (4440.00 283.30)
    (4500.00 283.29)
    (4560.00 283.28)
    (4620.00 283.26)
    (4680.00 283.25)
    (4740.00 283.24)
    (4800.00 283.23)
    (4860.00 283.22)
    (4920.00 283.21)
    (4980.00 283.20)
    (5040.00 283.18)
    (5100.00 283.17)
    (5160.00 283.16)
    (5220.00 283.16)
    (5280.00 283.15)
    (5340.00 283.14)
    (5400.00 283.13)
    (5460.00 283.12)
    (5520.00 283.11)
    (5580.00 283.10)
    (5640.00 283.10)
    (5700.00 283.09)
    (5760.00 283.08)
    (5820.00 283.08)
    (5880.00 283.07)
...
)