tutorials/chtMultiRegion4PCMFoam/EPCMBlock/constant/TskyVsTime
(
    (0.00 273.01)
    (60.00 272.98)
    (120.00 272.94)
    (180.00 272.91)
    (240.00 272.88)
    (300.00 272.85)
    (360.00 272.82)
    (420.00 272.79)
    (480.00 272.76)
    (540.00 272.73)
    (600.00 272.69)
    (660.00 272.66)
    (720.00 272.63)
    (780.00 272.61)
    (840.00 272.58)
    (900.00 272.55)
    (960.00 272.52)
    (1020.00 272.49)
    (1080.00 272.46)
    (1140.00 272.43)
    (1200.00 272.41)
    (1260.00 272.38)
    (1320.00 272.35)
    (1380.00 272.32)
    (1440.00 272.30)
    (1500.00 272.27)
    (1560.00 272.24)
    (1620.00 272.22)
    (1680.00 272.19)
    (1740.00 272.17)
    (1800.00 272.14)
    (1860.00 272.12)
    (1920.00 272.09)
    (1980.00 272.07)
    (2040.00 272.04)
    (2100.00 272.02)
    (2160.00 272.00)
    (2220.00 271.97)
    (2280.00 271.95)
    (2340.00 271.93)
    (2400.00 271.90)
    (2460.00 271.88)
    (2520.00 271.86)
    (2580.00 271.84)
    (2640.00 271.82)
    (2700.00 271.80)
    (2760.00 271.78)
    (2820.00 271.75)
    (2880.00 271.73)
    (2940.00 271.71)
    (3000.00 271.69)
    (3060.00 271.67)
    (3120.00 271.66)
    (3180.00 271.64)
    (3240.00 271.62)
    (3300.00 271.60)
    (3360.00 271.58)
    (3420.00 271.56)
    (3480.00 271.55)
    (3540.00 271.53)
    (3600.00 271.51)
    (3660.00 271.49)
    (3720.00 271.48)
    (3780.00 271.46)
    (3840.00 271.45)
    (3900.00 271.43)
    (3960.00 271.41)
    (4020.00 271.40)
    (4080.00 271.38)
    (4140.00 271.37)
    (4200.00 271.36)
    (4260.00 271.34)
    (4320.00 271.33)
    (4380.00 271.31)
    (4440.00 271.30)
    (4500.00 271.29)
    (4560.00 271.28)
    (4620.00 271.26)
    (4680.00 271.25)
    (4740.00 271.24)
    (4800.00 271.23)
    (4860.00 271.22)
    (4920.00 271.21)
    (4980.00 271.20)
    (5040.00 271.18)
    (5100.00 271.17)
    (5160.00 271.16)
    (5220.00 271.16)
    (5280.00 271.15)
    (5340.00 271.14)
    (5400.00 271.13)
    (5460.00 271.12)
    (5520.00 271.11)
    (5580.00 271.10)
    (5640.00 271.10)
    (5700.00 271.09)
    (5760.00 271.08)
    (5820.00 271.08)
    (5880.00 271.07)
...
)