tutorials/chtMultiRegion4PCMFoam/EPCMBlock/constant/block/EPCMProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      EPCMProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

omega		omega [ 0 0 0 0 0 0 0 ]		0.447;
lambda		lambda [ 0 0 0 0 0 0 0 ]	3;

//Thermal properties of EPCM's core: n_octadecane
core
{
    rho		rho [ 1 -3 0 0 0 0 0 ]		841;
    Cp		Cp [ 0 2 -2 -1 0 0 0 ]		2127;
    kappa	kappa [ 1 1 -3 -1 0 0 0 ]	0.1505;
    hm		hm [ 0 2 -2 0 0 0 0 ]		243500;
    Tm		Tm [ 0 0 0 1 0 0 0 ]		301.35;
    Tmr		Tmr [ 0 0 0 1 0 0 0 ]		6.0;
}

//Thermal properties of EPCM's shell
shell
{
    rho		rho [ 1 -3 0 0 0 0 0 ]		1185;
    Cp		Cp [ 0 2 -2 -1 0 0 0 ]		1466;
    kappa	kappa [ 1 1 -3 -1 0 0 0 ]	0.2;
    d		d [ 0 1 0 0 0 0 0 ]		50e-09;
}
// ************************************************************************* //
