tutorials/chtMultiRegion4PCMFoam/EPCMBlock/constant/hollow/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;
type            forcedConvection;

nu		nu [0 2 -1 0 0 0 0]		1.54e-5;

rho		rho [1 -3 0 0 0 0 0]		1.1925;
Cp		Cp [0 2 -2 -1 0 0 0]		1006.2;
kappa		kappa [ 1 1 -3 -1 0 0 0 ]	0.025820;
mu		mu [ 1 -1 -1 0 0 0 0 ]		1.835e-5;
beta            beta [0 0 0 -1 0 0 0]		3.7e-3;
TRef            TRef [0 0 0 1 0 0 0]		296;
Prt		Prt [0 0 0 0 0 0 0]		0.85;

// ************************************************************************* //
