tutorials/chtMultiRegion4PCMFoam/EPCMBlock/system/block/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changePatchTypeDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    T
    {
        internalField   uniform 283;

        boundaryField
        {
            top
            {
                type            zeroGradient;
            }

            bottom
            {
                type            zeroGradient;
            }

            left
            {
                type            zeroGradient;
            }

            right
            {
                type            zeroGradient;
            }

            front
            {
                //type            fixedValue;
                //value           uniform 340;

                type                    timeVaryingMixedRobin4PCMFoam;
                Kappa                   kappams;
                absorptivity            0.65;
                emissivity              0.87;

                qs
                {
                    "fileName|file" "$FOAM_CASE/constant/qsVsTime";
                    outOfBounds     repeat;
                }

                ho
                {
                    "fileName|file" "$FOAM_CASE/constant/hoVsTime";
                    outOfBounds     repeat;
                }

                To
                {
                    "fileName|file" "$FOAM_CASE/constant/ToVsTime";
                    outOfBounds     repeat;
                }

                Tsky
                {
                    "fileName|file" "$FOAM_CASE/constant/TskyVsTime";
                    outOfBounds     repeat;
                }

                value           uniform 283;
            }

            back
            {
                type            robin4PCMFoam;
                Kappa		kappams;
                qo		(0);
                ho		(25);
                To		(298);
            }

            block_to_hollow
            {
                type            solidWallMixedTemperatureCoupled;
                neighbourRegionName hollow;
                neighbourPatchName hollow_to_block;
                neighbourFieldName T;
                Kappa           kappams;
                value           uniform 283;
            }
        }
    }

    rho
    {
        internalField   uniform 1800;

        boundaryField
        {
            top
            {
                type            zeroGradient;
            }

            bottom
            {
                type            zeroGradient;
            }

            left
            {
                type            zeroGradient;
            }

            right
            {
                type            zeroGradient;
            }

            front
            {
                type            zeroGradient;
            }

            back
            {
                type            zeroGradient;
            }

            block_to_hollow
            {
                type            zeroGradient;
            }
        }
    }

    Kappa
    {
        internalField   uniform 0.72;

        boundaryField
        {
            top
            {
                type            zeroGradient;
            }

            bottom
            {
                type            zeroGradient;
            }

            left
            {
                type            zeroGradient;
            }

            right
            {
                type            zeroGradient;
            }

            front
            {
                type            zeroGradient;
            }

            back
            {
                type            zeroGradient;
            }

            block_to_hollow
            {
                type            zeroGradient;
            }
        }
    }

    cp
    {
        internalField   uniform 829;

        boundaryField
        {
            top
            {
                type            zeroGradient;
            }

            bottom
            {
                type            zeroGradient;
            }

            left
            {
                type            zeroGradient;
            }

            right
            {
                type            zeroGradient;
            }

            front
            {
                type            zeroGradient;
            }

            back
            {
                type            zeroGradient;
            }

            block_to_hollow
            {
                type            zeroGradient;
            }
        }
    }

    alphaEPCMs
    {
        internalField   uniform 0.05;

        boundaryField
        {
            top
            {
                type            zeroGradient;
            }

            bottom
            {
                type            zeroGradient;
            }

            left
            {
                type            zeroGradient;
            }

            right
            {
                type            zeroGradient;
            }

            front
            {
                type            zeroGradient;
            }

            back
            {
                type            zeroGradient;
            }

            block_to_hollow
            {
                type            zeroGradient;
            }
        }
    }
}


// ************************************************************************* //
